Hello @justinretzolk!

I've given it a try under v4.15.1:
```
Terraform v1.2.1
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v4.15.1
```

Unfortunately, I get the same attempt to recreate, so looks like it's a slightly different one:

```
  # aws_organizations_account.test will be created
  + resource "aws_organizations_account" "test" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + email             = (sensitive)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Test"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```